---
kind: property
id: P:Autodesk.Revit.DB.Blend.TopSketch
source: html/4b60c6f8-55e2-376f-858d-d0309bd934e2.htm
---
# Autodesk.Revit.DB.Blend.TopSketch Property

Returns the Top Sketch of the Blend.

## Syntax (C#)
```csharp
public Sketch TopSketch { get; }
```

## Remarks
This property is used to retrieve the Top Sketch of the Blend.